psas/liblpc23xx/lpc23xx-adc/include/lpc23xx-adc.h

/* Copyright (C) 2011 Keith Wilson.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
 * ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 * 
 * Except as contained in this notice, the names of the authors or their
 * institutions shall not be used in advertising or otherwise to promote the
 * sale, use or other dealings in this Software without prior written
 * authorization from the authors.
 */


/*
 * lpc23xx-adc.h
 */

#ifndef _LPC23XX_ADC_H
#define _LPC23XX_ADC_H

#include "lpc23xx-util.h"
#include "lpc23xx-pll.h"

// AD0CR
#define     AD0CR_CLKDIV          8
#define     AD0CR_BURST           16
#define     AD0CR_CLKS            17
#define     AD0CR_PDN             21
#define     AD0CR_START           24
#define     AD0CR_EDGE            24



#define     ADC_ENABLE            (AD0CR = (AD0CR |  (1 << AD0CR_PDN)))
#define     ADC_DISABLE           (AD0CR = (AD0CR & ~(1 << AD0CR_PDN)))

// P0.23
#define     PINSEL_ADC0_0                (PINSEL1  = (PINSEL1 & ~(0x3 << 14)) | (0x01 << 14))
#define     ADC0_0_NOPULLUP_NOPULLDOWN   (PINMODE1 = (PINMODE1 & ~(0x3 << 14)) | (0x2 << 14))

// P0.24
#define     PINSEL_ADC0_1                (PINSEL1  = (PINSEL1 & ~(0x3 << 16)) | (0x01 << 16))
#define     ADC0_1_NOPULLUP_NOPULLDOWN   (PINMODE1 = (PINMODE1 & ~(0x3 << 16)) | (0x2 << 16))

// P0.25
#define     PINSEL_ADC0_2                (PINSEL1  = (PINSEL1 & ~(0x3 << 18)) | (0x01 << 18))
#define     ADC0_2_NOPULLUP_NOPULLDOWN   (PINMODE1 = (PINMODE1 & ~(0x3 << 18)) | (0x2 << 18))

// P0.26
#define     PINSEL_ADC0_3                (PINSEL1  = (PINSEL1 & ~(0x3 << 20)) | (0x01 << 20))
#define     ADC0_3_NOPULLUP_NOPULLDOWN   (PINMODE1 = (PINMODE1 & ~(0x3 << 20)) | (0x2 << 20))

// P1.30
#define     PINSEL_ADC0_4                (PINSEL3  = (PINSEL3 & ~(0x3 << 28)) | (0x03 << 28))
#define     ADC0_4_NOPULLUP_NOPULLDOWN   (PINMODE3 = (PINMODE3 & ~(0x3 << 28)) | (0x2 << 28))

// P1.31
#define     PINSEL_ADC0_5                (PINSEL3  = (PINSEL3 & ~(0x3 << 30)) | (0x03 << 30))
#define     ADC0_5_NOPULLUP_NOPULLDOWN   (PINMODE3 = (PINMODE3 & ~(0x3 << 30)) | (0x2 << 30))


#if defined (LPC2378) || defined (LPC2388)

    // P0.12
    #define     PINSEL_ADC0_6                (PINSEL0  = (PINSEL0 & ~(0x00 << 24)) | (0x03 << 24))
    #define     ADC0_6_NOPULLUP_NOPULLDOWN   (PINMODE0 = (PINMODE0 & ~(0x00 << 24)) | (0x2 << 24))
    
    // P0.13
    #define     PINSEL_ADC0_7                (PINSEL0  = (PINSEL0 & ~(0x00 << 26)) | (0x03 << 26))
    #define     ADC0_7_NOPULLUP_NOPULLDOWN   (PINMODE0 = (PINMODE0 & ~(0x00 << 26)) | (0x2 << 26))
    
#endif

#define     AD0DR0_DONE           ((AD0DR0 & 0x80000000) >> 31)
#define     AD0DR1_DONE           ((AD0DR1 & 0x80000000) >> 31)
#define     AD0DR2_DONE           ((AD0DR1 & 0x80000000) >> 31)
#define     AD0DR3_DONE           ((AD0DR3 & 0x80000000) >> 31)
#define     AD0DR4_DONE           ((AD0DR4 & 0x80000000) >> 31)
#define     AD0DR5_DONE           ((AD0DR5 & 0x80000000) >> 31)
#define     AD0DR6_DONE           ((AD0DR6 & 0x80000000) >> 31)
#define     AD0DR7_DONE           ((AD0DR7 & 0x80000000) >> 31)

typedef     uint8_t               adc_channelmask;

typedef     enum {ADC0_0=0, ADC0_1, ADC0_2, 
                  ADC0_3,   ADC0_4, ADC0_5, 
                  ADC0_6,   ADC0_7} adc_channel;

void        adc_init_cont(adc_channelmask channels, pclk_scale scale) ;
void        adc_disable(void) ;
uint16_t    adc_read(adc_channel ch) ;

#endif

